app/views/users/organizer_dashboard.html.erb

SELECT "events".* FROM "events" WHERE "events"."organizer_id" = $1  [["organizer_id", 17]]
---

  <% current_user.events.each do |event|%>