app/views/attenders/show.html.erb

SELECT "attenders".* FROM "attenders" WHERE "attenders"."event_id" = $1  [["event_id", 1]]
---

  <% @event.attenders.each do |attender|%>