app/views/tickets/show.html.erb

      </div>
      <%if @event.ticket.count>0%>
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."event_id" = $1 ORDER BY "tickets"."id" ASC LIMIT $2  [["event_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "tickets" WHERE "tickets"."event_id" = $1  [["event_id", 2]]