app/controllers/attenders_controller.rb

  def show
    @attender = Attender.find(params[:id])
---
SELECT "attenders".* FROM "attenders" WHERE "attenders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]