app/controllers/events_controller.rb

  def create
    if user_signed_in?
      @organizer = Organizer.find(params[:event][:organizer_id])
---
SELECT "organizers".* FROM "organizers" WHERE "organizers"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]