app/controllers/events_controller.rb

  def show
    @events = Event.all
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events"
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @user = current_user
    @event = @user.events.create(event_params)
    CrudNotificatonMailer.create_notification(@event).deliver_now
---
INSERT INTO "events" ("title", "date", "time", "venue", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["title", ""], ["date", nil], ["time", nil], ["venue", ""], ["description", ""], ["user_id", 1], ["created_at", "2023-10-26 11:09:33.119443"], ["updated_at", "2023-10-26 11:09:33.119443"]]
INSERT INTO "events" ("title", "date", "time", "venue", "description", "created_at", "updated_at", "organizer_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @event = Event.find(params[:id])
    if @event.update(event_params)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "events" SET "title" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["title", "birthdaybash"], ["updated_at", "2023-10-27 08:56:40.096200"], ["id", 4]]