app/controllers/organizers_controller.rb

SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "organizer"]]
---
  def index
    @organizers = User.all.where(role: "organizer")