app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets" ORDER BY "tickets"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @tickets = Ticket.all

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."event_id" = $1 ORDER BY "tickets"."id" ASC LIMIT $2  [["event_id", 1], ["LIMIT", 1]]
---
  def show
    @event = Event.find(params[:event_id])
    @ticket = @event.tickets
    @booked = 0
    @unbooked = 0
    @ticket.each do|t|